name = "Тимур"
surname = "Камильянов"
f_string = (f"Привет! Меня зовут {surname} {name}, я студент Python в Академии \"Топ\"."
            f" Изучаю Python на начальном уровне."
            f"\n\nНедавно закончился блок фронт-енд части у моей группы Python315."
            f"Было круто еще раз погрузиться в JS и еще больше углубиться.\n\n"
            f"Не думаю, что у меня получилась крутая экзаменационная работа,"
            f" так как я не очень хорошо разобрался в блоке JS.")

print(f_string)